import { useState } from 'react';
import { Form, Space, Drawer } from 'antd';
import styled from 'styled-components';
import { useHistory } from 'react-router-dom';

import { ILogin } from '../../shared/login.interface';
import { ButtonColor, FontTextHeader, BaseInput, LogoPage, MoveCenter, MoveBottom, Pivacy } from 'components/pages/Authentication/shared/style';
import Container from 'components/Container/Container';

import logo from '../../images/logo.png';
import { collapseTextChangeRangesAcrossMultipleVersions } from 'typescript';


function Login() {
  const history = useHistory();
  const [email, setEmail] = useState<string>('');
  const [password, setPassword] = useState<string>('');

  const [visible, setVisible] = useState(false);
  const [placement, setPlacement] = useState<string>('bottom');

  const onFinish = (values: ILogin) => {
    const mockUser = require('../../mocks/user.json');
    const currentUser = mockUser.find((user: ILogin) => user.email === values.email);

    mockUser.find((user: ILogin) => console.log(user));
    if (values.password === currentUser?.password) {
      history.push('/');
    } else {
      console.log('Failed login');
    }
    console.log('Success:', values);
  };

  function checkdatajson() {
    const mockUser = require('../../mocks/user.json');
    const currentUser = mockUser.find((user: ILogin) => user.email === email);

    mockUser.find((user: ILogin) => console.log(user));
    if (password === currentUser?.password) {
      history.push('/home');
    } else {
      alert('ไม่ผู้ใช้นี้ อีเมลหรือรหัสผ่านไม่ถูกต้อง')
      console.log('Failed login');
    }
  }

  const showDrawer = () => {
    setVisible(true);
  };

  const onClose = () => {
    setVisible(false);
  };

  return (
      <Container header={{left: 'back' , right: 'menu'}}>
      <Pivacy>
      <MoveCenter>
        <Drawer 
              title="Privacy Policy"
              placement="bottom"
              closable={false}
              onClose={onClose}
              visible={visible}
              key={placement}
              getContainer={false}
              height= {500}
              style={{ position: 'absolute'}}
            >
              <div>
              <p>นโยบายความเป็นส่วนตัว</p>
              <p>
                บริษัท วอนเดอร์ (ไทยแลนด์) จำกัด ให้ความสำคัญกับการคุ้มครองข้อมูลส่วนบุคคลของคุณ โดยนโยบายความเป็นส่วนตัวฉบับนี้ได้อธิบายแนวปฏิบัติเกี่ยวกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล รวมถึงสิทธิต่าง ๆ ของเจ้าของข้อมูลส่วนบุคคล ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
              </p>

              <p>การเก็บรวบรวมข้อมูลส่วนบุคคล</p>

              <p>
                เราจะเก็บรวบรวมข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณผ่านช่องทาง ดังต่อไปนี้ การลงทะเบียนและการสมัครบัญชีผู้ใช้งานผ่านทางเว็บไซต์บริษัท การทำแบบสอบถามความสนใจ การติดต่อผ่านโทรศัพท์ อีเมล เป็นต้น
              </p>

              <p>
                เราอาจเก็บรวบรวมข้อมูลส่วนบุคคลของคุณที่เราเข้าถึงได้จากแหล่งอื่น เช่น โซเชียลมีเดีย หน่วยงานราชการ บุคคลภายนอกอื่น ๆ เป็นต้น
              </p>

              <p>
                ประเภทข้อมูลส่วนบุคคลที่เก็บรวบรวม
              </p>

              <p>
              เยี่ยมชมทุกคนสามารถเข้าถึงเนื้อหาที่เผยแพร่บนเว็บไซต์ของเรา ได้ อย่างไรก็ตามคุณลักษณะและบริการ บางอย่างอาจต้องมีการลงทะเบียน ผู้ใช้สามารถลงทะเบียน (“ สมัครใช้งาน”) ได้ที่หน้าเว็บไซต์ 
              โดยคุณสามารถเพิ่มสิทธิการเข้าถึงบริการอื่น ๆ ได้โดยการทำตามกระบวนการที่เหมาะสม เช่น การชำระเงินเพื่อเข้าถึงเนื้อหาและบริการอื่น ๆ ตามเงื่อนไขที่ทางเรากำหนด</p>

              <p>ข้อมูลส่วนบุคคลที่เราเก็บรวบรวมจากคุณ ได้แก่ ข้อมูลใด ๆ ซึ่งสามารถใช้ในการระบุตัวตนของท่านได้ไม่ว่าโดยตรงหรือโดยอ้อม ซึ่งรวมถึงแต่ไม่จำกัดเพียงข้อมูลดังต่อไปนี้</p>

              <p>ข้อมูลส่วนบุคคล เช่น ชื่อ นามสกุล อายุ วันเดือนปีเกิด สัญชาติ เลขประจำตัวประชาชน หนังสือเดินทาง เป็นต้น</p>

              <p>ข้อมูลการติดต่อ เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล เป็นต้น</p>

              <p>ข้อมูลบัญชี เช่น บัญชีผู้ใช้งาน ประวัติการใช้งาน เป็นต้น</p>

              <p>หลักฐานแสดงตัวตน เช่น สำเนาบัตรประจำตัวประชาชน สำเนาหนังสือเดินทาง เป็นต้น</p>

              <p>ข้อมูลการทำธุระกรรม เช่น ประวัติการสั่งซื้อ</p>

              <p>ข้อมูลทางเทคนิค เช่น IP Address, Cookie ID, ประวัติการใช้งานเว็บไซต์ (Activity Log) เป็นต้น</p>

              <p>ข้อมูลอื่น ๆ เช่น รูปภาพ ภาพเคลื่อนไหว และข้อมูลอื่นใดที่ถือว่าเป็นข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล</p>

              <p>เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลอ่อนไหว เมื่อเราได้รับความยินยอมโดยชัดแจ้งจากคุณ เว้นแต่กฎหมายกำหนดให้ทำได้ 
                ได้แก่ ข้อมูลสุขภาพ ศาสนา ข้อมูลชีวภาพ เช่น ข้อมูลภาพจำลองใบหน้า ข้อมูลจำลองม่านตา ข้อมูลจำลองลายนิ้วมือ เป็นต้น 
                รวมถึงข้อมูลอื่นใดที่กระทบต่อข้อมูลส่วนบุคคลของคุณตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด</p>

              <p>ผู้เยาว์</p>

              <p>หากคุณมีอายุต่ำกว่า 20 ปีหรือมีข้อจำกัดความสามารถตามกฎหมาย เราอาจเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ 
                เราอาจจำเป็นต้องให้พ่อแม่หรือผู้ปกครองของคุณให้ความยินยอมหรือที่กฎหมายอนุญาตให้ทำได้ 
                หากเราทราบว่ามีการเก็บรวบรวมข้อมูลส่วนบุคคลจากผู้เยาว์โดยไม่ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครอง 
                เราจะดำเนินการลบข้อมูลนั้นออกจากเซิร์ฟเวอร์ของเรา</p>

              <p>วิธีการเก็บรักษาข้อมูลส่วนบุคคล</p>

              <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณในรูปแบบเอกสารและรูปแบบอิเล็กทรอนิกส์ 
                เราเก็บรักษาข้อมูลส่วนบุคคลของคุณบนเซิร์ฟเวอร์บริษัทของเราในประเทศไทย และ บนระบบคลาวด์ของ Amazon Web Services (AWS) ณ ประเทศสิงคโปร์</p>

              <p>การประมวลผลข้อมูลส่วนบุคคล</p>

              <p>เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณตามคำขอ และ/หรือข้อตกลงที่ท่านได้ทำไว้กับบริษัท ซึ่งรวมถึงแต่ไม่จำกัดเพียงวัตถุประสงค์ดังต่อไปนี้</p>

              <p>1. เพื่อสร้างและจัดการบัญชีผู้ใช้งาน ยืนยันหรือระบุตัวตนของท่านในเวลาที่คุณเข้าใช้แพลตฟอร์มของเรา เพื่อการบริหารและจัดการภายในองค์กร</p>

              <p>2. ป้องกันและตรวจสอบการฉ้อโกงการละเมิดความปลอดภัยในกิจกรรมต่าง ๆ ที่อาจต้องผิดกฎหมายและข้อตกลงและเงื่อนไขการใช้งานของของเรา</p>

              <p>3. ปรับแต่ง ประเมิน และปรับปรุงการให้บริการเนื้อหา และการโฆษณาของเรา</p>

              <p>4. เพื่อให้บริการด้านการศึกษา จัดหาเนื้อหา ผลิตภัณฑ์ รวมถึงการให้บริการอื่น ๆ ที่เกี่ยวข้อง</p>

              <p>5. เพื่อดำเนินการตามคำขอของคุณก่อนการเข้าทำสัญญากับบริษัท และพิจารณาอนุมัติเกี่ยวกับการให้บริการ รวมถึงส่งมอบผลิตภัณฑ์ และ/
              หรือบริการของเราแก่ท่าน</p>

              <p>6. เพื่อการตลาดและการส่งเสริมการขาย บริการหลังการขาย แจ้งการอัพเดทสื่อการสอน กิจกรรม ฟีเจอร์ใหม่บนแพลตฟอร์ม ข่าวสาร เพื่อประโยชน์ของคุณ</p>

              <p>7. เพื่อรวบรวมข้อเสนอแนะ ใช้ในการ วิจัย ประเมิน พัฒนา และปรับปรุงการให้บริการ ฟีเจอร์ 
                และเทคโนโลยีบนแพลตฟอร์มให้มีประสิทธิภาพและตอบสนองต่อความต้องการของผู้ใช้บริการมากยิ่งขึ้น</p>

              <p>8. เพื่อให้ผู้ให้บริการติดต่อคุณทางอีเมลหรือโทรศัพท์เพื่อแก้ไขปัญหาและการเรียกเก็บค่าธรรมเนียม</p>

              <p>9. เพื่อเป็นการปฏิบัติตามนโยบายข้อตกลงและเงื่อนไขของเรา และเพื่อเป็นการปฏิบัติตามกฎหมายและกฎระเบียบของหน่วยงานราชการต่าง ๆ</p>

              <p>การเปิดเผยข้อมูลส่วนบุคคล</p>

              <p>เพื่อปกป้องข้อมูลส่วนบุคคลของคุณจากการฉ้อโกงและการทำธุรกรรมที่ไม่ได้รับอนุญาต (เช่นการฟอกเงิน) การฟ้องร้องและความรับผิดอื่น ๆ เ
                ราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณให้แก่ผู้อื่นภายใต้ความยินยอมของคุณหรือที่กฎหมายอนุญาตให้เปิดเผยได้ 
                โดยบุคคลภายนอกนั้นรวมถึง บริษัทในเครือ คู่ค้าของบริษัท และ/หรือบุคคลหรือนิติบุคคลอื่นใดที่บริษัทมีนิติสัมพันธ์ด้วย 
                ไม่ว่าจะมีวัตถุประสงค์เพื่อการค้าหรือไม่ รวมถึงกรรมการ ผู้บริหาร พนักงาน ลูกจ้าง ผู้รับจ้าง ตัวแทน หรือที่ปรึกษาของบริษัท 
                ซึ่งรวมถึงแต่ไม่จำกัดเพียงบุคคล/องค์กรดังต่อไปนี้</p>

              <p>การบริหารจัดการภายในองค์กร</p>

              <p>เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณภายในบริษัทเท่าที่จำเป็นเพื่อปรับปรุงและพัฒนาสินค้าหรือบริการของเรา 
                เราอาจรวบรวมข้อมูลภายในสำหรับสินค้าหรือบริการต่าง ๆ ภายใต้นโยบายนี้เพื่อประโยชน์ของคุณและผู้อื่นมากขึ้น</p>

              <p>ผู้ให้บริการ</p>

              <p>เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณบางอย่างให้กับผู้ให้บริการของเราเท่าที่จำเป็นเพื่อดำเนินงานในด้านต่าง ๆ 
                เช่น การชำระเงิน การตลาด การพัฒนาสินค้าหรือบริการ เป็นต้น 
                โดยเราไม่สามารถเข้าถึงข้อมูลการชำระเงินของคุณกับผู้ให้บริการของเราได้ 
                และข้อมูลนี้อยู่ภายใต้นโยบายความเป็นส่วนตัวของผู้ให้บริการ 
                สำหรับข้อมูลเพิ่มเติมเกี่ยวกับการชำระเงินที่ผู้ให้บริการของเรารวบรวมและวิธีการที่ผู้ให้บริการใช้ข้อมูลนี้ โปรดดูนโยบายความเป็นส่วนตัวของตัวผู้ให้บริการ</p>

              <p>พันธมิตรทางธุรกิจ</p>

              <p>เราอาจเปิดเผยข้อมูลบางอย่างกับพันธมิตรทางธุรกิจเพื่อติดต่อและประสานงานในการให้บริการสินค้าหรือบริการ 
                และให้ข้อมูลเท่าที่จำเป็นเกี่ยวกับความพร้อมใช้งานของสินค้าหรือบริการ</p>

              <p>การถ่ายโอนธุรกิจ</p>

              <p>เราอาจเปิดเผยข้อมูล รวมถึงข้อมูลส่วนบุคคลของคุณ สำหรับการปรับโครงสร้างองค์กร การควบรวมหรือการขายกิจการ 
                หรือการถ่ายโอนสินทรัพย์อื่น ๆ โดยฝ่ายที่รับโอนต้องปฏิบัติกับข้อมูลของคุณในลักษณะที่สอดคล้องกับนโยบายนี้ รวมถึงกฎหมายคุ้มครองข้อมูลส่วนบุคคลด้วย</p>

              <p>การโอนข้อมูลส่วนบุคคลไปต่างประเทศ</p>

              <p>เราอาจเปิดเผยหรือโอนข้อมูลส่วนบุคคลของคุณไปยังบุคคล องค์กร หรือบนระบบคลาวด์ของ Amazon Web Services (AWS) ณ ประเทศสิงคโปร์ 
                ทั้งนี้ เราจะดำเนินการตามมาตรการต่าง ๆ เพื่อให้มั่นใจว่าการโอนข้อมูลส่วนบุคคลของคุณไปยังประเทศปลายทางนั้นมีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลอย่างเพียงพอ หรือกรณีอื่น ๆ ตามที่กฎหมายกำหนด</p>

              <p>ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล</p>

              <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตามระยะเวลาที่จำเป็นในระหว่างที่คุณเป็นลูกค้าหรือมีความสัมพันธ์อยู่กับเรา หรือ 
                ตลอดระยะเวลาที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวข้องกับนโยบายฉบับนี้ 
                ซึ่งอาจจำเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น หากมีกฎหมายกำหนดไว้ เราจะลบ ทำลาย หรือทำให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของคุณได้ 
                เมื่อหมดความจำเป็นหรือสิ้นสุดระยะเวลาดังกล่าว</p>

              <p>สิทธิเกี่ยวกับข้อมูลส่วนบุคคล</p>

              <p>เมื่อคุณให้ข้อมูลส่วนบุคคลกับเรา แล้วคุณมีสิทธิหลายประการซึ่งคุณสามารถดำเนินการใช้สิทธิได้โดยไม่เสียค่าใช้จ่ายภายใต้ข้อยกเว้นตามกฎหมาย</p>

              <p>สิทธิของคุณภายใต้พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 คุณมีสิทธิในการดำเนินการ ดังต่อไปนี้</p>

              <p>สิทธิขอถอนความยินยอม (right to withdraw consent) หากคุณได้ให้ความยินยอม เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ 
                ไม่ว่าจะเป็นความยินยอมที่คุณให้ไว้ก่อนวันที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลใช้บังคับหรือหลังจากนั้น คุณมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดเวลา</p>

              <p>สิทธิขอเข้าถึงข้อมูล (right to access) คุณมีสิทธิขอเข้าถึงข้อมูลส่วนบุคคลของคุณที่อยู่ในความรับผิดชอบของเรา และขอให้เราทำสำเนาข้อมูลดังกล่าวให้แก่คุณ รวมถึงขอให้เราเปิดเผยว่าเราได้ข้อมูลส่วนบุคคลของคุณมาได้อย่างไร</p>

              <p>สิทธิขอถ่ายโอนข้อมูล (right to data portability) คุณมีสิทธิขอรับข้อมูลส่วนบุคคลของคุณในกรณีที่เราได้จัดทำข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ รวมทั้งมีสิทธิขอให้เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทำได้ด้วยวิธีการอัตโนมัติและมีสิทธิขอรับข้อมูลส่วนบุคคลที่เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง เว้นแต่ไม่สามารถดำเนินการได้เพราะเหตุทางเทคนิค</p>

              <p>สิทธิขอคัดค้าน (right to object) คุณมีสิทธิขอคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณในเวลาใดก็ได้ หากการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณที่ทำขึ้นเพื่อการดำเนินงานที่จำเป็นภายใต้ประโยชน์โดยชอบด้วยกฎหมายของเราหรือของบุคคลหรือนิติบุคคลอื่น โดยไม่เกินขอบเขตที่คุณสามารถคาดหมายได้อย่างสมเหตุสมผลหรือเพื่อดำเนินการตามภารกิจเพื่อสาธารณประโยชน์</p>

              <p>สิทธิขอให้ลบหรือทำลายข้อมูล (right to erasure/destruction) คุณมีสิทธิขอลบหรือทำลายข้อมูลส่วนบุคคลของคุณหรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวคุณได้ หากคุณเชื่อว่าข้อมูลส่วนบุคคลของคุณถูกเก็บรวบรวม ใช้ หรือเปิดเผยโดยไม่ชอบด้วยกฎหมายที่เกี่ยวข้อง หรือเห็นว่าเราหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้ หรือเมื่อคุณได้ใช้สิทธิขอถอนความยินยอมหรือใช้สิทธิขอคัดค้านตามที่แจ้งไว้ข้างต้นแล้ว</p>

              <p>สิทธิขอให้ระงับการใช้ข้อมูล (right to restriction of processing) คุณมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลชั่วคราวในกรณีที่เราอยู่ระหว่างตรวจสอบตามคำร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอคัดค้านของคุณ หรือกรณีอื่นใดที่เราหมดความจำเป็นและต้องลบหรือทำลายข้อมูลส่วนบุคคลของคุณตามกฎหมายที่เกี่ยวข้องแต่คุณขอให้เราระงับการใช้แทน</p>

              <p>สิทธิขอให้แก้ไขข้อมูล (right to rectification) คุณมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของคุณให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด</p>

              <p>สิทธิร้องเรียน (right to lodge a complaint) คุณมีสิทธิร้องเรียนต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง หากคุณเชื่อว่าการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ เป็นการกระทำในลักษณะที่ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง</p>

              <p>คุณสามารถใช้สิทธิของคุณในฐานะเจ้าของข้อมูลส่วนบุคคลข้างต้นได้ โดยติดต่อมาที่เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเราตามรายละเอียดท้ายนโยบายนี้ เราจะแจ้งผลการดำเนินการภายในระยะเวลา 30 วัน นับแต่วันที่เราได้รับคำขอใช้สิทธิจากคุณ ตามแบบฟอร์มหรือวิธีการที่เรากำหนด ทั้งนี้ หากเราปฏิเสธคำขอเราจะแจ้งเหตุผลของการปฏิเสธให้คุณทราบผ่านช่องทางต่าง ๆ เช่น ข้อความ (SMS) อีเมล โทรศัพท์ จดหมาย เป็นต้น</p>

              <p>การโฆษณาและการตลาด</p>

              <p>เพื่อประโยชน์ในการได้รับสินค้าหรือบริการของเรา เราใช้ข้อมูลของคุณเพื่อวิเคราะห์และปรับปรุงสินค้าหรือบริการ และทำการตลาดผ่าน Google, Facebook และอื่น ๆ เราใช้ข้อมูลดังกล่าวเพื่อให้สินค้าหรือบริการเหมาะสมกับคุณ</p>

              <p>เว็บไซต์ของเราอาจแสดงโฆษณาจากบุคคลที่สามเพื่ออำนวยความสะดวกในการบริการของเรา บุคคลที่สามเหล่านี้อาจเข้าถึงข้อมูลส่วนบุคคลของคุณเพื่อดำเนินการเหล่านี้เท่านั้น และมีหน้าที่ไม่เปิดเผยหรือใช้เพื่อวัตถุประสงค์อย่างอื่น</p>

              <p>เราจะไม่ใช้ระบบการตัดสินใจอัตโนมัติ (automated decision-making) โดยปราศจากการบุคคลกำกับดูแล รวมถึงการทำโปรไฟล์ลิ่ง (profiling) ในลักษณะที่ก่อให้เกิดผลกระทบกับคุณอย่างมีนัยสำคัญ</p>

              <p>เราอาจส่งข้อมูลหรือจดหมายข่าวไปยังอีเมลของคุณ โดยมีวัตถุประสงค์เพื่อเสนอสิ่งที่น่าสนกับคุณ หากคุณไม่ต้องการรับการติดต่อสื่อสารจากเราผ่านทางอีเมลอีกต่อไป คุณสามารถกด "ยกเลิกการติดต่อ" ในลิงก์อีเมลหรือติดต่อมายังอีเมลของเราได้</p>

              <p>เทคโนโลยีติดตามตัวบุคคล (Cookies)</p>

              <p>เพื่อเพิ่มประสบการณ์การใช้งานของคุณให้สมบูรณ์และมีประสิทธิภาพมากขึ้น เราใช้เทคโนโลยีติดตามตัวบุคคล(Cookies)หรือเทคโนโลยีที่คล้ายคลึงกัน เพื่อพัฒนาการเข้าถึงสินค้าหรือบริการ โฆษณาที่เหมาะสม และติดตามการใช้งานของคุณ เราใช้คุกกี้เพื่อระบุและติดตามผู้ใช้งานเว็บไซต์และการเข้าถึงเว็บไซต์ของเรา หากคุณไม่ต้องการให้มีคุกกี้ไว้ในคอมพิวเตอร์ของคุณ คุณสามารถตั้งค่าบราวเซอร์เพื่อปฏิเสธคุกกี้ก่อนที่จะใช้เว็บไซต์ของเราได้</p>

              <p>ประเภทของคุกกี้</p>

              <p>คุกกี้ที่มีความจำเป็นอย่างยิ่ง (Strictly Necessary Cookies): คุกกี้เหล่านี้คือคุกกี้ที่จำเป็นต้องมีเพื่อให้เว็บไซต์ทำงานได้และเป็นสิ่งจำเป็นที่ช่วยให้เราสามารถระบุตัวตนของผู้ใช้ และการเข้าถึง เพื่อป้องกันข้อมูลส่วนบุคคลได้อย่างถูกต้อง ปลอดภัย นอกจากนั้นยังเป็นตัวช่วยในการจัดการคอนเทนต์ตามสิทธิที่ได้รับอย่างถูกต้อง</p>

              <p>คุกกี้เพื่อการวิเคราะห์/เพื่อประสิทธิภาพ (Analytical Cookies): คุกกี้ประเภทนี้จะช่วยให้เราสามารถจดจำและจัดเก็บ Error log ที่เกิดขึ้นระหว่างการใช้งาน เพื่อปรับปรุงและแก้ไขการทำงานของเว็บไซต์ให้มีคุณภาพดีขึ้นและมีความเหมาะสมมากขึ้น อีกทั้งเพื่อรวบรวมข้อมูลทางสถิติเกี่ยวกับวิธีการเข้าและพฤติกรรมการเยี่ยมชมเว็บไซต์ซึ่งจะช่วยปรับปรุงการทำงานของเว็บไซต์โดยให้ผู้ใช้งานสามารถค้นหาสิ่งที่ต้องการได้อย่างง่ายดายและช่วยให้เราเข้าใจถึงความสนใจของผู้ใช้บริการ</p>

              <p> คุกกี้เพื่อการทำงานของเว็บไซต์ (Functionality Cookies): คุกกี้เหล่านี้ใช้ในการจัดเก็บ Cookie เพื่อการปรับแต่งภาษาของการใช้งานในระบบให้สอดคล้องกับผู้ใช้ เพื่อรองรับการเชื่อมต่อใหม่ในกรณีที่มีการถูกตัดขาด หรือเกิดปัญหาระหว่างใช้งาน และมีการจัดเก็บ Cookie เพื่อการจดจำจำนวน Interactive Function ที่เกิดขึ้นมาในระบบ</p>

              <p>การรักษาความมั่งคงปลอดภัยของข้อมูลส่วนบุคคล</p>

              <p>เราจะรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของคุณไว้ตามหลักการ การรักษาความลับ (confidentiality) ความถูกต้องครบถ้วน (integrity) และสภาพพร้อมใช้งาน (availability) ทั้งนี้ เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข หรือเปิดเผย นอกจากนี้เราจะจัดให้มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล ซึ่งครอบคลุมถึงมาตรการป้องกันด้านการบริหารจัดการ (administrative safeguard) มาตรการป้องกันด้านเทคนิค (technical safeguard) และมาตรการป้องกันทางกายภาพ (physical safeguard) ในเรื่องการเข้าถึงหรือควบคุมการใช้งานข้อมูลส่วนบุคคล (access control) นอกจากนี้ พนักงาน ลูกจ้าง และผู้ให้บริการภายนอกของเรามีหน้าที่ต้องรักษาความลับของข้อมูลส่วนบุคคลของเจ้าของข้อมูล และต้องปฏิบัติตามมาตรฐานและนโยบายการรักษาความปลอดภัยของข้อมูลที่เคร่งครัดเมื่อมีการใช้ ส่ง โอน หรือประมวลผลใด ๆ กับข้อมูลส่วนบุคคลของคุณ</p>

              <p>การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล</p>

              <p>ในกรณีที่มีเหตุละเมิดข้อมูลส่วนบุคคลของคุณเกิดขึ้น เราจะแจ้งให้สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลทราบโดยไม่ชักช้าภายใน 72 ชั่วโมง นับแต่ทราบเหตุเท่าที่สามารถกระทำได้ ในกรณีที่การละเมิดมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของคุณ เราจะแจ้งการละเมิดให้คุณทราบพร้อมกับแนวทางการเยียวยาโดยไม่ชักช้าผ่านช่องทางต่าง ๆ เช่น  เว็บไซต์ ข้อความ (SMS) อีเมล โทรศัพท์ จดหมาย เป็นต้น</p>

              <p>การแก้ไขเปลี่ยนแปลงนโยบายความเป็นส่วนตัว</p>

              <p>เราขอสงวนสิทธิในการแก้ไขเปลี่ยนแปลงนโยบายนี้เป็นครั้งคราว เราจะเผยแพร่การเปลี่ยนแปลงดังกล่าวบนหน้าเพจนี้ กรุณากลับเข้ามาอ่านหน้าเพจนี้เป็นระยะเพื่อให้ทราบถึงการปรับปรุงหรือการเปลี่ยนแปลงนโยบายความเป็นส่วนตัวของเรา สำหรับกรณีที่เป็นการเปลี่ยนแปลงในสาระสำคัญ เราจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงดังกล่าวโดยเร็ว</p>

              <p>นโยบายนี้แก้ไขล่าสุดและมีผลใช้บังคับตั้งแต่วันที่ 27 เมษายน 2564</p>

              <p>นโยบายความเป็นส่วนตัวของเว็บไซต์อื่น</p>

              <p>นโยบายความเป็นส่วนตัวฉบับนี้ใช้สำหรับการบริการ และการใช้งานบนเว็บไซต์ของเราเท่านั้น หากคุณเข้าชมเว็บไซต์อื่นแม้จะผ่านช่องทางเว็บไซต์ของเรา การคุ้มครองข้อมูลส่วนบุคคลต่าง ๆ จะเป็นไปตามนโยบายความเป็นส่วนตัวของเว็บไซต์นั้น ซึ่งเราไม่มีส่วนเกี่ยวข้องด้วย</p>
              </div>
            </Drawer>
       
        <LogoPage src={logo} preview={false} />
        <Space align="start">
          <FontTextHeader>เข้าสู่ระบบ</FontTextHeader>
        </Space>
        <Form initialValues={{ remember: true }} onFinish={onFinish}>
          <Form.Item
            name="email"
            hasFeedback
            rules={[
              {
                required: true,
                message: 'กรุณาใส่อีเมล!',
              },
            ]}
          >
            <BaseInput type="email" placeholder="อีเมล" />
          </Form.Item>
          <Form.Item
            name="password"
            hasFeedback
            rules={[
              {
                required: true,
                message: 'กรุณาใส่รหัสผ่าน!',
              },
            ]}
          >
            <BaseInput type="password" placeholder="รหัสผ่าน" />
          </Form.Item>

          <Form.Item>
            <ButtonColor onClick={checkdatajson} htmlType="submit">
              เข้าสู่ระบบ
            </ButtonColor>
          </Form.Item>

          <Form.Item>
            <MoveBottom>
              ยังไม่มีบัญชีใช่ไหม? <a onClick={showDrawer}>สร้างบัญชีกันเถอะ!</a>
            </MoveBottom>
          </Form.Item>
        </Form>
      </MoveCenter>
      </Pivacy>
    </Container>
  );
    
}

export default Login;
