import React from 'react';
import Container from 'components/Container/Container';
import { ImgMultipleInterlligences, ParagraphDescription, TextCategoryName, TextTopicTestOverview } from '../../shared/styles/TestOverview.styled';
import { Col } from 'antd';

function TestOverview() {
    //
    // ─── Set variable ───────────────────────────────────────────────────────────────────
    //
    const multipleInterlligencesList = [
        {
            categoryName: 'ปัญญาด้านภาษา (Word Smart)',
            description:
                'ผู้ที่มีปัญญาหรือความถนัดด้านนี้จะสามารถรับรู้ เข้าใจ และใช้ภาษาในรูปแบบต่าง ๆ ได้ดี เช่น ภาษาพูด ภาษามือ สามารถเรียนรู้ผ่านภาษาได้ดี เช่น ฟังจับใจความได้ดี มีทักษะในการอ่านเขียน ใช้คําและจดจําข้อมูล และสื่อสารด้วยภาษาได้ดี จึงมักถ่ายทอดความคิดออกมาเป็นคําพูด มากกว่าเป็นภาพ เก่งในการเล่าเรื่อง อธิบาย สอน พูดโน้มน้าวใจ',
        },
        {
            categoryName: 'ปัญญาด้านตรรกะ (Logic Smart)',
            description:
                'ผู้มีปัญญาด้านนี้มีความถนัดในการเรียนรู้ด้วยเหตุผล ตรรกะ และตัวเลข มีการคิดเป็นระบบ มีทักษะในการแก้ปัญหาจัดลําดับหรือจัดกลุ่มข้อมูล มีทักษะด้านคณิตศาสตร์ สามารถเชื่อมโยงข้อมูลชิ้นต่าง ๆ เข้าเป็นภาพใหญ่ กระตือรือร้นสนใจสิ่งรอบตัว ชอบตั้งคําถามและทดลองเพื่อให้ได้คําตอบ',
        },
        {
            categoryName: 'ปัญญาด้านมิติสัมพันธ์ (Picture Smart)',
            description:
                'ผู้มีปัญญาหรือความถนัดด้านนี้สามารถรับรู้ทางสายตาได้ดี มองเห็นพื้นที่ รูปทรง ระยะทาง และตําแหน่งอย่างเชื่อมโยงสัมพันธ์กัน ชอบเรียนรู้ด้วยแผนที่ตารางแผนภูมิรูปภาพวิดีโอและภาพยนตร์ มีทักษะการสเก็ตช์ภาพ วาดเขียน รวมไปถึง การออกแบบภาพมิติต่าง ๆ และจัดวางองค์ประกอบภาพได้ดี',
        },
        {
            categoryName: 'ปัญญาด้านร่างกายและการเคลื่อนไหว (Body Smart)',
            description:
                'ผู้ที่มีปัญญาด้านนี้โดดเด่นสามารถจดจํา ประมวลข้อมูลของสิ่งที่อยู่รอบตัวในสามมิติ ทําให้สามารถควบคุมร่างกายและการเคลื่อนไหวให้เข้ากับสภาพแวดล้อมได้ดี มีความไวทางประสาทสัมผัสคล่องแคล่วและยืดหยุ่น มีทักษะในการใช้สายตาสัมพันธ์กับส่วนอื่น ๆ ของร่างกายทั้งมือและเท้า มีความสามารถในการประดิษฐ์สร้างสรรค์สิ่งต่าง ๆ',
        },
        {
            categoryName: 'ปัญญาด้านดนตรี (Music Smart)',
            description:
                'ผู้ที่มีปัญญาหรือความถนัดด้านดนตรีจะสามารถสร้าง และเข้าถึงสุนทรียะทางดนตรี รู้สึกเป็นธรรมชาติที่สุดเมื่อได้ถ่ายทอดตัวตน ความรู้สึกนึกคิดผ่านบทเพลง เสียงดนตรี มีความไวต่อเสียงที่อยู่รอบตัว เช่น เสียงกระดิ่ง หยดน้ำ สามารถแยกแยะเสียงจดจําจังหวะทํานองและโครงสร้างทางดนตรีได้ดี ทําให้มีทักษะในการร้องเพลง เคาะจังหวะ หรือเล่นเครื่องดนตรี',
        },
        {
            categoryName: 'ปัญญาด้านสังคมและปฏิสัมพันธ์ (People Smart)',
            description:
                'ผู้ที่มีปัญญาหรือความถนัดด้านนี้ จะสามารถสร้างความสัมพันธ์และเข้าใจผู้อื่น มีทักษะในการเข้าใจถึงอารมณ์ ความรู้สึก แรงบันดาลใจ และแรงกระตุ้นของผู้คน รับฟังผู้อื่น มีความเห็นอกเห็นใจ มีความรู้สึกร่วม และให้คำปรึกษาได้ สื่อสารและทํางานร่วมกับผู้อื่นได้ดี สามารถโน้มน้าวและเป็นแรงบันดาลใจให้กับผู้คน เป็นนักจัดการความขัดแย้งและประสานความร่วมมือ',
        },
        {
            categoryName: 'ปัญญาด้านการรับรู้และเข้าใจตนเอง (Self Smart)',
            description:
                'ผู้ที่มีปัญญาหรือความถนัดด้านนี้ จะสามารถรู้จัก ตระหนักรู้ และเท่าทันตนเอง มองภาพตนเองตามความเป็นจริง เข้าใจจุดแข็งและจุดอ่อนของตนชัดเจนว่าตนชอบหรือไม่ชอบอะไร เข้าใจบทบาทหน้าที่ของตนและสัมพันธภาพกับผู้อื่น มีความเข้าใจอารมณ์ความรู้สึกและแรงจูงใจของตนเองอย่างลึกซึ้ง ควบคุมการแสดงออกอย่างเหมาะสมตามกาลเทศะ',
        },
        {
            categoryName: 'ปัญญาด้านธรรมชาติวิทยา (Nature Smart)',
            description:
                'ผู้มีปัญญาหรือความถนัดด้านนี้ จะสนใจสิ่งมีชีวิตและสภาพแวดล้อมทางธรรมชาติ เข้าใจปรากฏการณ์ การเปลี่ยนแปลงในธรรมชาติ และปรับตัวเข้ากับสิ่งแวดล้อมได้ดี สามารถคาดการณ์ความเป็นไปของธรรมชาติและสิ่งแวดล้อม สามารถแยกแยะประเภทของสิ่งมีชีวิตทั้งพืชและสัตว์ มีความรู้สึกเห็นอกเห็นใจและเข้าใจธรรมชาติรอบตัว',
        },
    ];
    return (
        <div>
            <Container header={{ left: 'back', children: 'ข้อมูลส่วนตัว', right: 'menu' }}>
                <TextTopicTestOverview>พหุปัญญา คืออะไร ?</TextTopicTestOverview>
                <ImgMultipleInterlligences />
                <Col>
                    <ParagraphDescription>
                        เพราะปัญญาของคนเราไม่ได้จํากัดอยู่เฉพาะความ สามารถทางคณิตศาสตร์และภาษาเท่านั้น ลองมาสํารวจ ตัวเองด้วยทฤษฎีพหุปัญญา ที่เชื่อว่าเราทุกคนต่างมี ปัญญาโดดเด่นหลากหลายแบ่งออกได้ 8
                        ด้าน ซึ่งทําให้ แต่ละคนมีวิธีการเรียนรู้ และมีความสามารถเฉพาะตัว
                    </ParagraphDescription>
                    <ParagraphDescription>
                        {multipleInterlligencesList.map((item, index) => {
                            return (
                                <div key={index}>
                                    <TextCategoryName>{item.categoryName}</TextCategoryName>
                                    <br />
                                    <div>{item.description}</div>
                                </div>
                            );
                        })}
                    </ParagraphDescription>
                </Col>
            </Container>
        </div>
    );
}

export default TestOverview;
